FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
#include "mpu6050.hpp"
#include "stm32l4xx_hal.h"
#include "vector3d.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
#include <expected>

const char* MPU6050::error_to_string(const Error error) noexcept
{
    switch (error) {
        case Error::OK:
            return "OK ERROR";
        case Error::INIT:
            return "INIT ERROR";
        case Error::DEINIT:
            return "DEINIT ERROR";
        case Error::ACCEL:
            return "ACCEL ERROR";
        case Error::GYRO:
            return "GYRO ERROR";
        case Error::TEMP:
            return "TEMP ERROR";
        default:
            return "NONE ERROR";
    }
}

Scaled MPU6050::gyro_range_to_scale(const std::uint8_t gyro_range) noexcept
{
    switch (gyro_range) {
        case GYRO_FS_250:
            return 0.007633;
        case GYRO_FS_500:
            return 0.015267;
        case GYRO_FS_1000:
            return 0.030487;
        case GYRO_FS_2000:
            return 0.060975;
        default:
            return 0.0;
    }
}

Scaled MPU6050::accel_range_to_scale(const std::uint8_t accel_range) noexcept
{
    switch (accel_range) {
        case ACCEL_FS_2:
            return 0.000061;
        case ACCEL_FS_4:
            return 0.000122;
        case ACCEL_FS_8:
            return 0.000244;
        case ACCEL_FS_16:
            return 0.0004882;
        default:
            return 0.0;
    }
}

MPU6050::MPU6050(I2C_Handle i2c,
                 const std::uint8_t addres,
                 const std::uint8_t gyro_range,
                 const std::uint8_t accel_range) noexcept :
    i2c_{i2c}, addres_{addres}, gyro_range_{gyro_range}, accel_range_{accel_range}
{
    if (initialize() != Error::OK) {
    }
}

MPU6050::~MPU6050() noexcept
{
    if (deinitialize() != Error::OK) {
    }
}

Error MPU6050::initialize() noexcept
{
    if (initialized_) {
        return Error::INIT;
    }
    if (auto err{device_reset(1)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_sleep_enabled(0)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_clock_source(CLOCK_INTERNAL)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_dlpf(DLPF_BW_20)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_full_scale_gyro_range(gyro_range_)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_full_scale_accel_range(accel_range_)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_interrupt()}; err != Error::OK) {
        return err;
    }
    initialized_ = true;
    return Error::OK;
}

Error MPU6050::deinitialize() noexcept
{
    if (!initialized_) {
        return Error::DEINIT;
    }
    device_reset(PWR1_DEVICE_RESET_BIT);
    initialized_ = false;
    return Error::OK;
}

Error MPU6050::set_dlpf(const std::uint8_t value) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_, addres_, RA_CONFIG, sizeof(RA_CONFIG), &buffer, sizeof(buffer), i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= std::uint8_t{0xF8};
    buffer |= std::uint8_t(value & 0x7);
    if (auto err{HAL_I2C_Mem_Write(i2c_, addres_, RA_CONFIG, sizeof(RA_CONFIG), &buffer, sizeof(buffer), i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

//
// PWR_MGMT_1
//
Error MPU6050::device_reset(const std::uint8_t reset) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_PWR_MGMT_1,
                                  sizeof(RA_PWR_MGMT_1),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::DEINIT;
    }
    buffer &= ~std::uint8_t(0x01 << PWR1_DEVICE_RESET_BIT);
    buffer |= std::uint8_t((reset & 0x1) << PWR1_DEVICE_RESET_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_PWR_MGMT_1,
                                   sizeof(RA_PWR_MGMT_1),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::DEINIT;
    }
    return Error::OK;
}

Error MPU6050::set_sleep_enabled(const std::uint8_t enable) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_PWR_MGMT_1,
                                  sizeof(RA_PWR_MGMT_1),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= ~std::uint8_t(0x01 << PWR1_SLEEP_BIT);
    buffer |= std::uint8_t((enable & 0x1) << PWR1_SLEEP_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_PWR_MGMT_1,
                                   sizeof(RA_PWR_MGMT_1),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_cycle_enabled(const std::uint8_t enable) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_PWR_MGMT_1,
                                  sizeof(RA_PWR_MGMT_1),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= ~std::uint8_t(0x01 << PWR1_CYCLE_BIT);
    buffer |= std::uint8_t((enable & 0x1) << PWR1_CYCLE_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_PWR_MGMT_1,
                                   sizeof(RA_PWR_MGMT_1),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_temperature_sensor_disabled(const std::uint8_t disable) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_PWR_MGMT_1,
                                  sizeof(RA_PWR_MGMT_1),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::DEINIT;
    }
    buffer &= ~std::uint8_t(0x01 << PWR1_TEMP_DIS_BIT);
    buffer |= std::uint8_t((disable & 0x1) << PWR1_TEMP_DIS_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_PWR_MGMT_1,
                                   sizeof(RA_PWR_MGMT_1),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::DEINIT;
    }
    return Error::OK;
}

