FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
Error MPU6050::set_clock_source(const std::uint8_t source) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_PWR_MGMT_1,
                                  sizeof(RA_PWR_MGMT_1),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= 0xF8;
    buffer |= std::uint8_t(source & 0x7);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_PWR_MGMT_1,
                                   sizeof(RA_PWR_MGMT_1),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

//
//	PWR_MGMT_2
//
Error MPU6050::set_low_power_wake_up_frequency(const std::uint8_t frequency) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_PWR_MGMT_2,
                                  sizeof(RA_PWR_MGMT_2),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= 0x3F;
    buffer |= std::uint8_t(frequency & 0x3) << PWR2_LP_WAKE_CTRL_BIT;
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_PWR_MGMT_2,
                                   sizeof(RA_PWR_MGMT_2),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::accelerometer_axis_standby(const std::uint8_t x_accel_standby,
                                          const std::uint8_t y_accel_standby,
                                          const std::uint8_t z_accel_standby) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_PWR_MGMT_2,
                                  sizeof(RA_PWR_MGMT_2),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::ACCEL;
    }
    buffer &= 0xC7;
    buffer |= std::uint8_t((x_accel_standby & 0x1) << PWR2_STBY_XA_BIT) |
              ((y_accel_standby & 0x1) << PWR2_STBY_YA_BIT) | ((z_accel_standby & 0x1) << PWR2_STBY_ZA_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_PWR_MGMT_2,
                                   sizeof(RA_PWR_MGMT_2),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::ACCEL;
    }
    return Error::OK;
}

Error MPU6050::gyroscope_axis_standby(const std::uint8_t x_gyro_standby,
                                      const std::uint8_t y_gyro_standby,
                                      const std::uint8_t z_gyro_standby) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_PWR_MGMT_2,
                                  sizeof(RA_PWR_MGMT_2),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::GYRO;
    }
    buffer &= 0xF8;
    buffer |= std::uint8_t((x_gyro_standby & 0x1) << PWR2_STBY_XG_BIT) | ((y_gyro_standby & 0x1) << PWR2_STBY_YG_BIT) |
              ((z_gyro_standby & 0x1) << PWR2_STBY_ZG_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_PWR_MGMT_2,
                                   sizeof(RA_PWR_MGMT_2),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::GYRO;
    }
    return Error::OK;
}

//
//	Measurement scale configuration
//
Error MPU6050::set_full_scale_gyro_range(const std::uint8_t range) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_GYRO_CONFIG,
                                  sizeof(RA_GYRO_CONFIG),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::GYRO;
    }
    buffer &= 0xE7;
    buffer |= std::uint8_t((range & 0x7) << 3);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_GYRO_CONFIG,
                                   sizeof(RA_GYRO_CONFIG),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::GYRO;
    }
    return Error::OK;
}

Error MPU6050::set_full_scale_accel_range(const std::uint8_t range) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_ACCEL_CONFIG,
                                  sizeof(RA_ACCEL_CONFIG),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::ACCEL;
    }
    buffer &= 0xE7;
    buffer |= std::uint8_t((range & 0x7) << 3);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_ACCEL_CONFIG,
                                   sizeof(RA_ACCEL_CONFIG),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::ACCEL;
    }
    return Error::OK;
}

//
// Reading data
//
ExpectedTempRaw MPU6050::get_temperature_raw() const noexcept
{
    std::uint8_t buffer[2];
    if (auto err{
            HAL_I2C_Mem_Read(i2c_, addres_, RA_TEMP_OUT_H, sizeof(RA_TEMP_OUT_H), buffer, sizeof(buffer), i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::TEMP};
    }
    return ExpectedTempRaw{((static_cast<TempRaw>(buffer[0])) << 8) | buffer[1]};
}

ExpectedTempScaled MPU6050::get_temperature_celsius() const noexcept
{
    if (auto temp_raw{get_temperature_raw()}; !temp_raw.has_value()) {
        return Unexpected{Error::TEMP};
    } else {
        return ExpectedTempScaled{static_cast<TempScaled>((temp_raw.value())) / 340 + 36.53};
    }
}

ExpectedRaw MPU6050::get_acceleration_x_raw() const noexcept
{
    std::uint8_t buffer[2];
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_ACCEL_XOUT_H,
                                  sizeof(RA_ACCEL_XOUT_H),
                                  buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::ACCEL};
    }
    return ExpectedRaw{((static_cast<Raw>(buffer[0])) << 8) | buffer[1]};
}

ExpectedRaw MPU6050::get_acceleration_y_raw() const noexcept
{
    std::uint8_t buffer[2];
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_ACCEL_YOUT_H,
                                  sizeof(RA_ACCEL_YOUT_H),
                                  buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::ACCEL};
    }
    return ExpectedRaw{((static_cast<Raw>(buffer[0])) << 8) | buffer[1]};
}

ExpectedRaw MPU6050::get_acceleration_z_raw() const noexcept
{
    std::uint8_t buffer[2];
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_ACCEL_ZOUT_H,
                                  sizeof(RA_ACCEL_ZOUT_H),
                                  buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::INIT};
    }
    return ExpectedRaw{((static_cast<Raw>(buffer[0])) << 8) | buffer[1]};
}

ExpectedAccelRaw MPU6050::get_accelerometer_raw() const noexcept
{
    std::uint8_t buffer[6];
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_ACCEL_XOUT_H,
                                  sizeof(RA_ACCEL_XOUT_H),
                                  buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::ACCEL};
    }
    return ExpectedAccelRaw{std::in_place,
                            ((static_cast<Raw>(buffer[0])) << 8) | buffer[1],
                            ((static_cast<Raw>(buffer[2])) << 8) | buffer[3],
                            ((static_cast<Raw>(buffer[4])) << 8) | buffer[5]};
}

ExpectedAccelScaled MPU6050::get_accelerometer_scaled() const noexcept
{
    const auto accel_scale{accel_range_to_scale(accel_range_)};
    if (auto accel_raw{get_accelerometer_raw()}; !accel_raw.has_value()) {
        return Unexpected{accel_raw.error()};
    } else {
        return ExpectedAccelScaled{std::in_place,
                                   static_cast<Scaled>(accel_raw.value().x) * accel_scale,
                                   static_cast<Scaled>(accel_raw.value().y) * accel_scale,
                                   static_cast<Scaled>(accel_raw.value().z) * accel_scale};
    }
}

ExpectedRaw MPU6050::get_rotation_x_raw() const noexcept
{
    std::uint8_t buffer[2];
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_GYRO_XOUT_H,
                                  sizeof(RA_GYRO_XOUT_H),
                                  buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::GYRO};
    }
    return ExpectedRaw{((static_cast<Raw>(buffer[0])) << 8) | buffer[1]};
}

ExpectedRaw MPU6050::get_rotation_y_raw() const noexcept
{
    std::uint8_t buffer[2];
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_GYRO_YOUT_H,
                                  sizeof(RA_GYRO_YOUT_H),
                                  buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::GYRO};
    }
    return ExpectedRaw{((static_cast<Raw>(buffer[0])) << 8) | buffer[1]};
}

ExpectedRaw MPU6050::get_rotation_z_raw() const noexcept
{
    std::uint8_t buffer[2];
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_GYRO_ZOUT_H,
                                  sizeof(RA_GYRO_ZOUT_H),
                                  buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::GYRO};
    }
    return ExpectedRaw{((static_cast<Raw>(buffer[0])) << 8) | buffer[1]};
}

ExpectedGyroRaw MPU6050::get_gyroscope_raw() const noexcept
{
    std::uint8_t buffer[6];
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_GYRO_XOUT_H,
                                  sizeof(RA_GYRO_XOUT_H),
                                  buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::GYRO};
    }
    return ExpectedGyroRaw{std::in_place,
                           ((static_cast<Raw>(buffer[0])) << 8) | buffer[1],
                           ((static_cast<Raw>(buffer[2])) << 8) | buffer[3],
                           ((static_cast<Raw>(buffer[4])) << 8) | buffer[5]};
}

