FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
ExpectedGyroScaled MPU6050::get_gyroscope_scaled() const noexcept
{
    const auto gyro_scale{gyro_range_to_scale(gyro_range_)};
    if (auto gyro_raw{get_gyroscope_raw()}; !gyro_raw.has_value()) {
        return Unexpected{gyro_raw.error()};
    } else {
        return ExpectedGyroScaled{std::in_place,
                                  static_cast<Scaled>(gyro_raw.value().x) * gyro_scale,
                                  static_cast<Scaled>(gyro_raw.value().y) * gyro_scale,
                                  static_cast<Scaled>(gyro_raw.value().z) * gyro_scale};
    }
}

ExpectedRPY MPU6050::get_roll_pitch_yaw() const noexcept
{
    if (auto accel_scaled{get_accelerometer_scaled()}; !accel_scaled.has_value()) {
        return Unexpected{accel_scaled.error()};
    } else {
        return ExpectedRPY{std::in_place,
                           std::atan2(accel_scaled.value().y, accel_scaled.value().z) * 180.0 / M_PI,
                           -(std::atan2(accel_scaled.value().x,
                                        std::sqrt(accel_scaled.value().y * accel_scaled.value().y +
                                                  accel_scaled.value().z * accel_scaled.value().z)) *
                             180.0) /
                               M_PI,
                           {}};
    }
}

Error MPU6050::set_interrupt() const noexcept
{
    if (auto err{set_interrupt_mode(INTMODE_ACTIVEHIGH)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_interrupt_drive(INTDRV_PUSHPULL)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_interrupt_latch(INTLATCH_WAITCLEAR)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_interrupt_latch_clear(INTCLEAR_STATUSREAD)}; err != Error::OK) {
        return err;
    }

    // Disable all interrupts
    if (auto err{set_int_enable_register(0)}; err != Error::OK) {
        return err;
    }

    // Enable Motion interrputs
    if (auto err{set_dhpf_mode(DHPF_5)}; err != Error::OK) {
        return err;
    }

    if (auto err{set_int_motion_enabled(1)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_int_zero_motion_enabled(1)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_int_free_fall_enabled(1)}; err != Error::OK) {
        return err;
    }

    if (auto err{set_free_fall_detection_duration(2)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_free_fall_detection_threshold(5)}; err != Error::OK) {
        return err;
    }

    if (auto err{set_motion_detection_duration(5)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_motion_detection_threshold(2)}; err != Error::OK) {
        return err;
    }

    if (auto err{set_zero_motion_detection_duration(2)}; err != Error::OK) {
        return err;
    }
    if (auto err{set_zero_motion_detection_threshold(4)}; err != Error::OK) {
        return err;
    }
    return Error::OK;
}

//
//	set_ting Raw pin
//
Error MPU6050::set_interrupt_mode(const std::uint8_t mode) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_INT_PIN_CFG,
                                  sizeof(RA_INT_PIN_CFG),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= ~std::uint8_t(0x01 << INTCFG_INT_LEVEL_BIT);
    buffer |= std::uint8_t((mode & 0x1) << INTCFG_INT_LEVEL_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_INT_PIN_CFG,
                                   sizeof(RA_INT_PIN_CFG),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_interrupt_drive(const std::uint8_t drive) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_INT_PIN_CFG,
                                  sizeof(RA_INT_PIN_CFG),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= ~std::uint8_t(0x01 << INTCFG_INT_OPEN_BIT);
    buffer |= std::uint8_t((drive & 0x1) << INTCFG_INT_OPEN_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_INT_PIN_CFG,
                                   sizeof(RA_INT_PIN_CFG),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_interrupt_latch(const std::uint8_t latch) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_INT_PIN_CFG,
                                  sizeof(RA_INT_PIN_CFG),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= ~std::uint8_t(0x01 << INTCFG_INT_RD_CLEAR_BIT);
    buffer |= std::uint8_t((latch & 0x1) << INTCFG_INT_RD_CLEAR_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_INT_PIN_CFG,
                                   sizeof(RA_INT_PIN_CFG),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_interrupt_latch_clear(const std::uint8_t clear) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_INT_PIN_CFG,
                                  sizeof(RA_INT_PIN_CFG),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= ~std::uint8_t(0x01 << INTCFG_LATCH_INT_EN_BIT);
    buffer |= std::uint8_t((clear & 0x1) << INTCFG_LATCH_INT_EN_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_INT_PIN_CFG,
                                   sizeof(RA_INT_PIN_CFG),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_int_enable_register(std::uint8_t value) const noexcept
{
    if (auto err{HAL_I2C_Mem_Write(i2c_, addres_, RA_INT_ENABLE, sizeof(RA_INT_ENABLE), &value, 1, i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_int_data_ready_enabled(const std::uint8_t enable) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_INT_ENABLE,
                                  sizeof(RA_INT_ENABLE),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= ~std::uint8_t(0x01 << INTERRUPT_DATA_RDY_BIT);
    buffer |= std::uint8_t((enable & 0x1) << INTERRUPT_DATA_RDY_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_INT_ENABLE,
                                   sizeof(RA_INT_ENABLE),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

ExpectedAddres MPU6050::get_int_status_register() const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_INT_STATUS,
                                  sizeof(RA_INT_STATUS),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::INIT};
    }
    return ExpectedAddres{buffer};
}

ExpectedAddres MPU6050::get_device_id() const noexcept
{
    std::uint8_t buffer;
    if (auto err{
            HAL_I2C_Mem_Read(i2c_, addres_, RA_WHO_AM_I, sizeof(RA_WHO_AM_I), &buffer, sizeof(buffer), i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::INIT};
    }
    return ExpectedAddres{buffer << std::uint8_t{1}};
}

//
//	motion_ functions - not included in documentation/register map
//
Error MPU6050::set_dhpf_mode(const std::uint8_t dhpf) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_ACCEL_CONFIG,
                                  sizeof(RA_ACCEL_CONFIG),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= ~std::uint8_t(0x07);
    buffer |= std::uint8_t(dhpf & 0x7);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_ACCEL_CONFIG,
                                   sizeof(RA_ACCEL_CONFIG),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

ExpectedAddres MPU6050::get_motion_status_register() const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_MOT_DETECT_STATUS,
                                  sizeof(RA_MOT_DETECT_STATUS),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Unexpected{Error::INIT};
    }
    return ExpectedAddres{buffer};
}

Error MPU6050::set_int_zero_motion_enabled(const std::uint8_t enable) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_INT_ENABLE,
                                  sizeof(RA_INT_ENABLE),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= ~std::uint8_t(0x01 << INTERRUPT_ZMOT_BIT);
    buffer |= std::uint8_t((enable & 0x1) << INTERRUPT_ZMOT_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_INT_ENABLE,
                                   sizeof(RA_INT_ENABLE),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

