FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
Error MPU6050::set_int_motion_enabled(const std::uint8_t enable) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_INT_ENABLE,
                                  sizeof(RA_INT_ENABLE),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= ~std::uint8_t(0x01 << INTERRUPT_MOT_BIT);
    buffer |= std::uint8_t((enable & 0x1) << INTERRUPT_MOT_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_INT_ENABLE,
                                   sizeof(RA_INT_ENABLE),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_int_free_fall_enabled(const std::uint8_t enable) const noexcept
{
    std::uint8_t buffer;
    if (auto err{HAL_I2C_Mem_Read(i2c_,
                                  addres_,
                                  RA_INT_ENABLE,
                                  sizeof(RA_INT_ENABLE),
                                  &buffer,
                                  sizeof(buffer),
                                  i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    buffer &= ~std::uint8_t(0x01 << INTERRUPT_FF_BIT);
    buffer |= std::uint8_t((enable & 0x1) << INTERRUPT_FF_BIT);
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_INT_ENABLE,
                                   sizeof(RA_INT_ENABLE),
                                   &buffer,
                                   sizeof(buffer),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_motion_detection_threshold(std::uint8_t threshold) const noexcept
{
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_MOT_THR,
                                   sizeof(RA_MOT_THR),
                                   &threshold,
                                   sizeof(threshold),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_motion_detection_duration(std::uint8_t duration) const noexcept
{
    if (auto err{
            HAL_I2C_Mem_Write(i2c_, addres_, RA_MOT_DUR, sizeof(RA_MOT_DUR), &duration, sizeof(duration), i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_zero_motion_detection_threshold(std::uint8_t threshold) const noexcept
{
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_ZRMOT_THR,
                                   sizeof(RA_ZRMOT_THR),
                                   &threshold,
                                   sizeof(threshold),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_zero_motion_detection_duration(std::uint8_t duration) const noexcept
{
    if (auto err{HAL_I2C_Mem_Write(i2c_,
                                   addres_,
                                   RA_ZRMOT_DUR,
                                   sizeof(RA_ZRMOT_DUR),
                                   &duration,
                                   sizeof(duration),
                                   i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_free_fall_detection_threshold(std::uint8_t threshold) const noexcept
{
    if (auto err{
            HAL_I2C_Mem_Write(i2c_, addres_, RA_FF_THR, sizeof(RA_FF_THR), &threshold, sizeof(threshold), i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}

Error MPU6050::set_free_fall_detection_duration(std::uint8_t duration) const noexcept
{
    if (auto err{
            HAL_I2C_Mem_Write(i2c_, addres_, RA_FF_DUR, sizeof(RA_FF_DUR), &duration, sizeof(duration), i2c_TIMEOUT)};
        err != HAL_OK) {
        return Error::INIT;
    }
    return Error::OK;
}
